var t1 ={img:"https://i.pinimg.com/236x/0b/7a/12/0b7a12e4901957e91341b490616ad994.jpg",
Name: "ნარუტო",
Data:"2002",
Director:"მასაში კიშიმოტო ",
Description:"ამბის დაწყებამდე რამდენიმე წლით ადრე ფოთლებში დამალულ სოფელში გამოჩნდა ცხრაკუდა მელა. ეს სოფელი ხუთ უდიდეს შორის იყო, ადგილი სადაც პირველი კლასის ნინძები ცხოვრობდნენ. დემონი მელა არსაიდან გამოჩნდა და მრავალი ადამიანის სიცოცხლე შეიწირა, მხოლოდ სოფლის ლიდერმა, მეოთხე ჰოკაგემ შეძლო მისი შეჩერება, საკუთარი სიცოცხლის სანაცვლოდ, მელა მან ახალშობილის სხეულში ჩაბეჭდა, რომლის სახელიც უზუმაკი ნარუტოა..."
}
var t2 = {img:"https://i.pinimg.com/236x/f0/d3/87/f0d38703a89163cb7ace8e3743a4749d.jpg",
    Name:"დემონების მკვლელი",
    Data:"2019",
    Director:"ჰარუო სოტოძაკი",
    Description:"ტაიშოს ეპოქა, იაპონია. ტანჯირო, ნახშირით მოვაჭრე გულკეთილი ბიჭი, თავის ოჯახს დემონის მიერ მოკლულს პოულობს. თითქოსდა ეს საკმარისი არ ყოფილიყო, მისი უმცროსი და, ნეზუკო, დემონად იქნა გადაქცეული. ამ მწარე რეალობით განადგურებული ტანჯირო გადაწყვეტს რომ დემონების მკვლელი გახდეს, რათა დაუბრუნოს თავის დას ადამიანობა და მოკლას დემონი, რომელმაც მისი ოჯახი ამოწყვიტა ..."
}
var t3 = {img:"https://i.pinimg.com/236x/33/a4/8a/33a48a9346a1f3258323b388a30a14fc.jpg",
    Name:"ფარიკაობის ხელოვნება",
    Data:"2012",
    Director:"Tomohiko Itô",
    Description:"გამოცდილმა გეიმერმა გატესტა ახალი თამაში, რომელიც მას მერე რაც გამოვიდა აღმოჩნდა შემქმნელი კომპანიის ფარული იარაღი, რათა დაიმონოს ახალგაზრდები."
}
var t4 = {img:"https://i.pinimg.com/236x/c1/2d/d9/c12dd9a6c3d7aabf19355c8056f6f784.jpg",
    Name:"ბორუტო",
    Data:"2017",
    Director:"Yûko Sanpei",
    Description:"ეს არის ერთ-ერთი ცნობილი ანიმეს გაგრძელება, კერძოდ ნარუტოს შემდეგი თაობის ისტორია."
}
var t5 = {img:"https://i.pinimg.com/236x/c6/cd/9c/c6cd9c25c041b9ad48f5f791552a6dbe.jpg",
Name:"ტიტანებთან შერკინება",
Data:"2013",
Director:"არაკი ტეცურო",
Description:"საუკუნეების წინ ადამიანთა მოდგმა განადგურების პირას იდგა, მათი მთავარი მტერი ტიტანები იყვნენ, რომლებიც უბრალოდ გართობის მიზნით ანადგურებდნენ ადამიანებს. გადარჩენილი ადამიანების მცირე ჯგუფი მაღალი კედლით შემოსაზღვრულ ქალაქში ცხოვრობს, მაცხოვრებლებს არ უნახავთ ტიტანები უკვე ას წელზე მეტია. ერთ დღესაც ტიტანი გამოჩნდა და ქალაქის კედლის ნაწილი დაანგრია."
}
var t6 = {img:"https://i.pinimg.com/564x/6d/96/44/6d96447e995c5978c238cbb2bfa7b5ae.jpg",
    Name:"ტყეში ციცინატელების შუქში",
    Data:"2011",
    Director:"Takahiro Ômori",
    Description:"როცა ქალი ახალგაზრდა იყო, ჰოტარუ დაიკარგა, გოგონა თამაშობდა ტყესთან ახლოს ბიძის ტერიტორიაზე, სადაც ყოველ ზაფხულს ჩადიოდა. იქ მას ჰქონდა წინასწარმეტყველური შეხვედრა სულთან, რომელიც დაეხმარა. ბიჭი გაუჩინარდებოდა, თუ ადამიანი შეეხებოდა მას. გოგონამ დაიწყო მასთან ყოველ ზაფხულს სტუმრობა, როცა ის გაიზარდა, ბიჭი ელოდებოდა ზაფხულის მოსვლას. მათი ერთად ყოფნის დროს მოდიოდა ისევ."
}
var t7 = {img:"https://i.pinimg.com/236x/7c/df/f2/7cdff2ba04d0df5782007ba55015101c.jpg",
    Name:"ფერიის კუდი",
    Data:"2009",
    Director:"იოშიმიცუ შიმოიამა",
    Description:"ლუსი 17 წლის გოგონაა, რომელსაც სურს იყოს სრულფასოვანი ჯადოქარი. ერთ დღეს, როდესაც ჰარუჯიონ ქალაქს სტუმრობს, ის ხვდება ნაცუს, ახალგაზრდა კაცს, რომელიც ადვილად ავადდება ნებისმიერი ტიპის ტრანსპორტით. მაგრამ ნაცუ არ არის ჩვეულებრივი ბავშვი, ის არის მსოფლიოს ერთ-ერთი ყველაზე სამარცხვინო ჯადოქრების გილდიის: FAIRY TAIL-ის წევრი."
}
var t8 = {img:"https://i.pinimg.com/236x/84/ae/bc/84aebc4f87b5b25b32b5c7e39b389ca7.jpg",
    Name:"სიკვდილის დღიური",
    Data:"2006",
    Director:"არაკი ტეცურო",
    Description:"მკვლელობა რთული საქმეა კარგად მომზადებული ადამიანისთვისაც კი. ახლა წარმოიდგინეთ, რომ თქვენ გაქვთ ძალა მოკლათ ნებისმიერი ადამიანი, ვინც არ მოგწონთ და ამის გასაკეთებლად საკმარისია მისი სახელი ჩაწეროთ სიკვდილის დღიურში..."
}
var t9 = {img:"https://mykadri.com/uploads/posts/2021-05/1621366248_yasuke-poster.webp",
    Name:"იასუკე",
    Data:"2021",
    Director:"Thomas, LeSean",
    Description:"სოფელი, რომელიც საფრთხეშია, საიდუმლოებით მოცული ბავშვი, მეომარი დამიო და უდიდესი რონინი, რომელიც არასდროს ყოფილა ცნობილი ყველანაირი შეტაკებისა ჯადოქრების ჯადოქრებში. შეიტყვეთ პირველი აფრიკული სამურაის შესახებ."
}
var t10 = {img:"https://i.pinimg.com/564x/0a/57/f7/0a57f7fb9bf22d8b357affec4fc3ad03.jpg",
    Name:"შენი სახელი",
    Data:"2016",
    Director:"მაკოტო სინკაი",
    Description:"იაპონიის პროვინციაში მაცხოვრებელი გოგონა და ტოკიოში მაცხოვრებელი ბიჭი, აღმოაჩენენ რომ მათ შორის კავშირი არსებობს. ისინი ერთმანეთს ძილის დროს უკავშირდებიან."
}
var t11 = {img:"https://i.pinimg.com/564x/b6/96/64/b69664ecec271ef7d92bc35c8749782d.jpg",
    Name:"ეშმაკის ხაზი",
    Data:"2018",
    Director:"Hideaki Nakano",
    Description:"ანზაი -ნახევრად ვამპირია , ცუკასა -უბრალო სტუდენტი. ვამპირები ცხოვრობენ ადამიანებს შორის , იმიტომ რომ გარეგნულად არაფრით განსხვავდებიან ჩვენგან , ვერავინ ვერც კი ხვდება რომ ისინი არსებობენ. იმისთვის რომ იარსებონ არაა აუცილებელი რომ დალიონ სისხლი ,მაგრამ ხანდახან ,როდესაც მათ ძლიერი წყურვილი აწუხებთ ან ბრაზობენ ,ისინი ხდებიან უმართავები."
}
var t12 = {img:"https://i.pinimg.com/564x/46/81/a4/4681a46a74922631206fba34981ebee0.jpg",
    Name:"ნორაგამი",
    Data:"2014",
    Director:"KAMIYA",
    Description:"იატო - მოხეტიალე უსახლკარო იაპონური ღმერთია, სპორტული ფორმით და უცნაური ჩექმებით დახეტიალობს. ამ სამყაროში ღმერთების ძალა განისაზღვრება მათივე მიმდევრების რაოდენობით. ხოლო ღმერთების ამჟამინდელი მეტოქეები არიან მოჩვენებები, არსებები რომლებიც სულის და ხორციელთა გრძნობების შერწყმით წარმოიშვნენ, ისინი ადამიანების გონებას იპყრობენ და აიძულებენ ნებისმიერი რამის კეთებას რაც მათ სურთ.ღმერთი იატო მისმა ბოლო წმინდა იაღიმა მიატოვა და წავიდა მისგან, მარტო დარჩენილმა იატომ დაიწყო ახალი იარაღის ძიება რადგან ღმერთები წმინდა იარაღების გარეშე უბრალო მოვდავებივით სუსტები არიან. ზუსტათ ამ ძიებაში ღმერთი იატო გაიცნობს მდიდარი ოჯახის შვილს (გოგოს) იკი ჰიორის და ამით იწყება უსახლკარო ღმერთის თავგადასავალი."
}
var t13 = {img:"https://i.pinimg.com/564x/ea/6f/bf/ea6fbfca319a76b07b9a048fd67345ac.jpg",
    Name:"ბლიჩი",
    Data:"2010",
    Director:"Tite Kubo",
    Description:"კუროსაკი იჩიგო უბრალო 15 წლის ბიჭუნა არაა, რადგან რაც თავი ახსოვს ადამიანებისათვის უხილავ სულებთან შეუძლია საუბარი. ერთ საბედისწერო დღეს მას"
}
var t14 = {img:"https://i.pinimg.com/564x/74/09/c6/7409c60203cd3ef5be70a28dcab6032c.jpg",
    Name:"უკანასკნელი სერაფიმი",
    Data:"2015",
    Director:"Miyu Irino",
    Description:"2012 წელს, სამყარო განადგურდა ადამიანის მიერ შექმნილი ვირუსის წყალობით, რის გამოც მოსახლეობა განადგურდა და მხოლოდ ბავშვები გადარჩნენ. ამ დროს ვამპირები გამოდიან დედამიწის სიღრმეებიდან"
}
var t15 = {img:"https://i.pinimg.com/236x/bf/83/3e/bf833eb6b27d48cee39a299ae83eda08.jpg",
    Name:"ლეგენდა ჰეიზე",
    Data:"2021",
    Director:"Shan Xin,",
    Description:"მღელვარე ადამიანთა სამყაროში სხვადასხვა დემონები იმალებიან და მშვიდობიანად ცხოვრობენ ადამიანებთან ერთად. ლუო სიაოჰეი, კატა დემონი, იწყებს ხეტიალის მოგზაურობას, რადგან მისი ტყის სახლი განადგურდა. ახალი სახლის ძიებისას იგი სხვა დემონებსაც შეხვდება და ეზიარება განსხვავებულ ცხოვრებასაც, რაც მას საგონებელშ ჩააგდებს თუ რომელი მხარეა მისი ნამდვილი სახე"
}

var arr = [t1,t2,t3,t4,t5,t6,t7,t8,t9,t10,t11,t12,t13,t14,t15]
var main = document.querySelector(".main")
function sort(){
for(var i of arr){
    var card = `
    <div class="card mb-3" style="max-width: 540px;">
  <div class="row no-gutters">
    <div class="col-md-4">
      <img src="${i.img}" alt="...">
    </div>
    <div class="col-md-8">
      <div class="card-body">
        <h5 class="card-title">${i.Name}</h5>
        <h5 class="card-title">${i.Data}</h5>
        <p class="card-text">${i.Director}</p>
        <p class="card-text"><small class="text-muted">${i.Description}</small></p>
      </div>
    </div>
  </div>
</div>
    `
    main.innerHTML += card
}
}
sort()
var Time = document.querySelector(".Time")
var alphabet = document.querySelector(".alphabet")

alphabet.addEventListener("click", function(){
    arr.sort(function(a,b){
if(a.Name < b.Name){
    return -1
}
else if(a.Name > b.Name){
    return 1
}
return 0 
})
main.innerHTML = ""
sort()
})
//--------------------------------------
Time.addEventListener("click", function(){
arr.sort(function(a,b){
    return a.Data - b.Data
})
main.innerHTML = ""
sort()
})
